<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>  
  <head>  
    <meta http-equiv="content-type" content="text/html; charset=windows-1250">  
    <meta name="generator" content="PSPad editor, www.pspad.com">  
    <title>
    </title>  
  </head>  
  <body><h1>Intraship trifft WaveMaker</h1>
    <p>Dieses Testprogramm demonstriert eine m&ouml;gliche Einbindung von DHL Intraship in eine WaveMaker-Anwendung. 
    </p>
    <p><strong>Inhaltsangabe:</strong>
    </p>
    <ul>
      <li>Voraussetzungen
      </li>
      <li>Versionen
      </li>
      <li>Zielvorgabe und Realisierung
      </li>
      <li>WSDL: 
      <code>ISService_1_0_de.wsdl
      </code>
      </li>
      <li>wsdl4j.jar
      </li>
      <li>Fehler nach Aufbau der Schnittstelle
      </li>
      <li>&Auml;nderungen an der Schnittstelle
      </li>
    </ul><h2>Voraussetzungen</h2><h3>Entwicklerportal der DHL</h3>
    <p>Um Informationen &uuml;ber die verschiedenen APIs von DHL Intraship zu erhalten, sowie  Zugang zum Testsystem zu erlangen, muss jeder Entwickler sich auf dem Entwicklerportal registrieren.
    </p>
    <ul>
      <li>
      <a href="https://entwickler.dhl.de/" title="Entwicklerportal der DHL">Entwicklerportal der DHL</a>
      </li>
    </ul>
    <p>Diese Testanwendung wird ohne Zugang zum Testsystem nicht funktionieren. 
    </p>
    <p>Allerdings kann man jede Web API durch entsprechende Testsysteme simulieren, was  aber den logischen Anteil, der bei der Nutzung des Logistikportals zum tragen kommt, nur unzureichend ber&uuml;cksichtigt.
    </p><h3>Entwicklung unter WaveMaker</h3>
    <p>Die Anforderungen um den Code, der in der WaveMaker IDE bearbeitet wird zu verstehen, sind sehr gering. Ein Anwender mit Grundkenntnissen wird keine Probleme habe zu verstehen, wie die Komponenten zusammenwirken. 
    </p>
    <p>Allerdings sollte der Gebrauch von ServiceVariablen und einfachen Variablen sowie Pages und Controls im Prinzip bekannt sein.
    </p>
    <p>Neben dem Gebrauch von Komponenten muss auch ein Grundverst&auml;ndnis f&uuml;r JavaScript  vorhanden sein.
    </p><h3>Entwicklung von JavaServices</h3>
    <p>Die Entwicklung von JavaServices unter WaveMaker sollten im Prinzip verstanden sein. Es empfiehlt sich mit einer externen Entwicklungsumgebung zu arbeiten.
    </p>
    <p>Dieses Projekt wurde mit Eclipse bearbeitet. Besonders die notwendigkeit den  Server zu debuggen macht ein externes Tool unumg&auml;nglich.
    </p><h2>Versionen</h2>
    <ul>
      <li>WaveMaker 6.7.0
      </li>
      <li>Eclpise (Juno)
      </li>
    </ul><h2>Zielvorgabe und Realisierung</h2>
    <p>Bei dieser Anwendung handelt es sich um ein reines Testprogramm. Es ist den  Testprogrammen nachempfunden, welche auf dem 
      <a href="https://entwickler.dhl.de/" title="Entwicklerportal der DHL">Entwicklerportal der DHL</a> zur Verf&uuml;gung gestellt werden.
    </p>
    <p>Die Requests die dieses Testprogramm erstellt, sind vom Aufbau identisch mit den Requests  welches das Java-Testprogramm des Entwicklerportals erstellt. 
    </p>
    <p>Das Java-Testprogramm des Entwicklerportals kann somit als Referenz zu diesem Testprogramm genutzt werden.
    </p>
    <p>Eine erste Version dieses Testprogrammes soll die Gesch&auml;ftskundenversand API vollst&auml;ndig implementieren.
    </p>
    <p>Dieses Testprogramm soll folgende Fragen kl&auml;ren:
    </p>
    <ul>
      <li>Ob und wie man mit WaveMaker auf Intraship zugreifen kann
      </li>
      <li>Ob man Request-Objecte im Client vorhalten kann um Serverzugriffe zu minimieren
      </li>
      <li>Wie man den Response im Client am besten verarbeiten kann (z.B.: XML-Label)
      </li>
      <li>Wie man die Schnittstelle in eine Anwendung einbindet
      </li>
      <li>Wie man &Auml;nderungen an der Schnittstelle vermeidet oder zumindest minimiert
      </li>
    </ul><h3>Request-Objecte</h3>
    <p>Ein Request-Object wird einer Methode des DHL-Service &uuml;bergeben und  enth&auml;lt eine logische Struktur auf Grund derer ein Vorgang &uuml;ber die DHL-API in  Gang gesetzt wird.
    </p>
    <ul>
      <li>Ein Request-Object wird vom RequestBuilder erstellt
      </li>
      <li>Der RequestBuilder ist ein JavaService (mit gleichem Namen) 
      </li>
      <li>Der Response wird in eine Variable gesichert 
      </li>
      <li>Diese Variable wird der Methode des DHL-Service als Parameter &uuml;bergeben 
      </li>
      <li>Die Datenwerte der Variable k&ouml;nnen beliebig im Client ge&auml;ndert werden
      </li>
      <li>Eine Variable ist im Fall von Request-Objecten kein einfacher Wert, sondern immer eine komplexe Struktur 
      </li>
    </ul>
    <p>Somit kann ein Request-Object f&uuml;r eine Methode des DHL-Service beliebig oft initialisiert  werden, ohne das hierzu der RequstBuilder erneut aufgerufen werden muss.
    </p><h3>Authentification Header</h3>
    <p>Es wird ein Authendification-Object erstellt werden, welches wie das  Request-Object der Methode des DHL-Service &uuml;bergeben wird. W&auml;hrend aber das Request-Object  direkt an die DHL-API weiter geleitet wird, wird das Authentification-Object als  SOAPHeader dem Webservicecontext hinzu gef&uuml;gt.
    </p>
    <ul>
      <li>Ein Authentication-Object wird vom JavaService CISBase erstellt
      </li>
      <li>Der Response wird in eine Variable gesichert
      </li>
      <li>Diese Variable wird der Methode des DHL-Service als Parameter &uuml;bergeben
      </li>
      <li>Die Datenwerte der Variable k&ouml;nnen beliebig im Client ge&auml;ndert werden
      </li>
      <li>Eine Variable ist im Fall von Authentication-Object kein einfacher Wert, sondern immer eine komplexe Struktur 
      </li>
    </ul>
    <p>Somit kann wie im Fall eines Request-Objectes, das Authentication-Object beliebig oft initialisiert werden, ohne hierzu den JavaService erneut aufrufen zu m&uuml;ssen. 
    </p><h3>Zugangsdaten</h3>
    <p>Der Zugriff auf die Intraship-APIs wird durch Zugangsdaten gesichert. Diese Zugangsdaten  erh&auml;lt nur, wer sich auf dem Entwicklerportal der DHL registrieren l&auml;sst.
    </p>
    <p>Im ersten Schritt kommt es zu eine Anmeldung basierend auf HTTP Basis Authentication. Zus&auml;tzlich werden noch Credentials f&uuml;r den Zugriff auf die jeweilige API ben&ouml;tigt.
    </p>
    <p>Die Anmeldedaten f&uuml;r die HTTP Basis Authentication k&ouml;nnen in den Projekteigenschaften  des Webservice hinterlegt werden. Die zus&auml;tzlichen Credentials k&ouml;nnen nach dem Start der  Anwendung in die Maske eingetragen werden.
    </p>
    <p>Alternativ dazu kann eine 
      <em>settings.ini
      </em> im Ordern 
      <em>resources/settings
      </em> hinterlegt  werden. Der Aufbau dieser Datei ist identisch mit dem Aufbau der Zugangsdatendatei  aus dem Java-Testprogramm, welches auf dem Entwicklerportal der DHL bezogen werden kann. 
    </p>
    <p>Wenn keine HTTP Basis Authentication und/oder Credentials vorhanden sind, werden  diese mit den Zugangsdaten aus der Datei 
      <em>settings.ini
      </em> erg&auml;nzt.
    </p><h2>WSDL: 
      <code>ISService_1_0_de.wsdl
      </code></h2>
    <p>Die WSDL-Datei ist nicht Teil des Repositories. Um die Testanwendung starten zu k&ouml;nnen,  empfiehlt es sich den WSDL-Import f&uuml;r einen Clone auszuf&uuml;hren.
    </p>
    <p>Die nachfolgenden Punkte erl&auml;utern worauf besonders geachtet werden muss:
    </p>
    <ul>
      <li>wsdl4j.jar
      </li>
      <li>&Auml;nderungen an der Schnittstelle
      </li>
      <li>Fehler nach Aufbau der Schnittstelle
      </li>
    </ul><h2>wsdl4j.jar</h2>
    <p>Zu jeder SOAP-API wird eine entsprechende URL bereitgestellt, welche auf eine WSDL-Resource verweist. Mit dieser URL wurde die Schnittstelle dieser Testanwendung mit Service und Proxy-Klassen eingerichtet.
    </p>
    <p>Da der Aufbau einer solchen Schnittstelle &uuml;ber eine WSDL-Resource in der WaveMaker-Online-Dokumentation  ausf&uuml;hrlich beschrieben ist, verweise ich hier nur auf die f&uuml;r mich hilfreichsten Links:
    </p>
    <ul>
      <li>
      <a href="http://dev.wavemaker.com/wiki/bin/wmdoc_6.6/WebServices#HImportingandCallingaSOAPService" title="Importing and Calling Web Services">Importing and Calling Web Services</a>  
      </li>
      <li>
      <a href="http://dev.wavemaker.com/wiki/bin/view/Documentation/AddaWebServiceCall" title="Add a Web Service Call">Add a Web Service Call</a>
      </li>
    </ul>
    <p>Damit ein Import unter WaveMaker grunds&auml;tzlich durchgef&uuml;hrt werden kann, ist ein WSDL-Importer notwendig. Beim Einrichten des Webservice weist die IDE auf die Bibliothek 
      <em>wsdl4j.jar
      </em> hin:
    </p>
    <ul>
      <li>
      <a href="http://sourceforge.net/projects/wsdl4j/" title="Download wsdl4j.jar von SourceForge">Download wsdl4j.jar von SourceForge</a>
      </li>
    </ul>
    <p>Diese Bibliothek wird in den 
      <em>lib
      </em>-Ordner des jeweiligen Projektes kopiert und  von dort automatisch durch die IDE den notwendigen Sourcen beim Ausf&uuml;hren der  Anwendung zur Verf&uuml;gung gestellt.
    </p>
    <p>Neben dem Import, wird die gesamte Repr&auml;sentation und Manipulation der Service- und Proxy-Klassen  ausgehend von dieser Bibliothek vorgenommen.
    </p><h2>Fehler nach Aufbau der Schnittstelle</h2><h3>DHL-Websercie: 
      <code>ISService_1_0_de
      </code></h3>
    <p>Der gleichnamige Webservice wurde durch den WSDL-Import angelegt und stellt alle  notwendigen Methoden f&uuml;r die Arbeit mit der Gesch&auml;ftskundenversand API zur Verf&uuml;gung.
    </p>
    <p>Allerdings haben sich in der Datei 
      <em>ISService10De.java
      </em> Fehler eingeschlichen. Ob diese  Fehler durch einen unsachgem&auml;&szlig;en Umgang mit dem Importer oder aber durch fehlerhafte Interpretation durch den Importer zustande kamen, wurde nicht n&auml;her untersucht.
    </p>
    <p>Diese Fehler fanden ebenfalls Einzug in die zugeh&ouml;rige 
      <code>servicedef.xml
      </code> des Webservice und  somit auch in die 
      <code>types.js
      </code> der Testanwendung.
    </p>
    <p>S&auml;mtliche Request-Klassen und einige Proxy-Klassen wurden einem falschen Package zugeordnet. <br />Es wurden zwei Packages angelegt:
    </p>
    <ul>
      <li>
      <code>intraship.ws.de
      </code>
      </li>
      <li>
      <code>intrashipservice.ws.de.isservice_1_0_de
      </code>
      </li>
    </ul>
    <p>Beim Aufl&ouml;sen der Fehler wurde wie folgt vorgegangen:
    </p>
    <ul>
      <li>&Uuml;ber QuickFix (Eclipse) die falschen Packagezuordnungen korrigieren
      </li>
      <li>In Eclipse die 
      <code>servciedef.xml
      </code> entsprechend anpassen
      </li>
      <li>
      <code>types.js
      </code> durch kompilieren der Java-Sourcen aus der WaveMaker-IDE heraus neu bilden
      </li>
    </ul>
    <p>Solange in 
      <code>types.js
      </code> die falschen Packagezuordnungen f&uuml;r einige Ressourcen des Webservice vorhanden sind, kann der Service nicht fehlerfrei ausgef&uuml;hrt werden.
    </p>
    <p>Au&szlig;er der Datei 
      <code>ISService10De.java
      </code> musste keine weitere Java-Source angepasst werden.    
    </p>
    <p>Beispiel f&uuml;r falsche Packagezuordnung in 
      <code>ISService10De.java
      </code>:
    </p>
    <p>Vorher:
    </p>
<pre><code>    public CreateShipmentResponse createShipmentDD(intrashipservice.ws.de.isservice_1_0_de.CreateShipmentDDRequest part1, Authentification header) {
      CreateShipmentResponse response;     
      SOAPBindingResolver.setBindingProperties(((BindingProvider) iswsServicePortTypeService), bindingProperties);
      SOAPBindingResolver.setHeaders(((WSBindingProvider) iswsServicePortTypeService), header);
      response = iswsServicePortTypeService.createShipmentDD(part1);
      return response;
    }
</code></pre>
    <p>Nachher:
    </p>
<pre><code>    import intraship.ws.de.CreateShipmentDDRequest;
    public CreateShipmentResponse createShipmentDD(CreateShipmentDDRequest part1, Authentification header) {
      CreateShipmentResponse response;     
      SOAPBindingResolver.setBindingProperties(((BindingProvider) iswsServicePortTypeService), bindingProperties);
      SOAPBindingResolver.setHeaders(((WSBindingProvider) iswsServicePortTypeService), header);
      response = iswsServicePortTypeService.createShipmentDD(part1);
      return response;
    }
</code></pre><h2>&Auml;nderungen an der Schnittstelle</h2><h3>Zugangsdaten</h3>
    <p>Um vom Server aus Zugriff auf die Zugansdaten der Datei 
      <code>settings.ini
      </code> zu erlangen, wurde die Schnittstelle des Service 
      <code>ISService_1_0_de
      </code> angepasst.
    </p>
<pre><code>    public CreateShipmentResponse createShipmentDD(CreateShipmentDDRequest part1, Authentification header) {
      CreateShipmentResponse response;
      /** 
       * Anpassung durch den Entwickler, wird nicht vom Importer ersetllt
       */            
      bindingProperties = Credentials.getInstance().setBindingProperitiesIfNeeded(bindingProperties);
      header = Credentials.getInstance().setAuthentificationIfNeeded(header);
      SOAPBindingResolver.setBindingProperties(((BindingProvider) iswsServicePortTypeService), bindingProperties);
      SOAPBindingResolver.setHeaders(((WSBindingProvider) iswsServicePortTypeService), header);
      response = iswsServicePortTypeService.createShipmentDD(part1);
      return response;
    }
</code></pre><h3>SOAPLoggingHandler</h3>
    <p>&Uuml;ber einen SOAPLoggingHandler kann ein Request und ein Response zur Analyse von Fehler komplett geloggt werden. Im Constructor des Webservice wurde zu diesem Zweck dessen Context ein SOAPLoggingHandler zugef&uuml;hrt. 
    </p>
    <p>Allerdings hat es Probleme beim Einsatz des daf&uuml;r vorgesehen SOAPHandlers gegeben:
    </p>
    <ul>
      <li>com.wavemaker.runtime.ws.jaxws.SOAPLoggingHandler
      </li>
    </ul>
    <p>Ob diese Probleme von einem falschen Verst&auml;ndnis des Handlers oder einem Bug herr&uuml;hrte, wurde nicht n&auml;her untersucht. Stattdessen wurde ein anderer LoggingHandler zum Einsatz gebracht:
    </p>
<pre><code>    public ISService10De() {
      ISService10DeClient isService10DeClient;
      try {
          URL wsdlLocation = new ClassPathResource("intrashipservice/ws/de/isservice_1_0_de/ISService_1_0_de.wsdl").getURL();
          isService10DeClient = new ISService10DeClient(wsdlLocation, isService10DeQName);
      } catch (IOException e) {
          isService10DeClient = new ISService10DeClient();
      }
      iswsServicePortTypeService = isService10DeClient.getShipmentServiceSOAP11Port0();
      /** 
       * Anpassung durch den Entwickler, wird nicht vom Importer ersetllt
       */            
      MySOAPLoggingHandler.addToPort(((BindingProvider) iswsServicePortTypeService).getBinding()); 
    }         
</code></pre>
    <p>Der LoggingHandler stammt von der Seite: 
      <a href="http://jgeeks.blogspot.de/2013/03/jaxws-handler-example-for-logging.html," title="http://jgeeks.blogspot.de/2013/03/jaxws-handler-example-for-logging.html">http://jgeeks.blogspot.de/2013/03/jaxws-handler-example-for-logging.html</a>von Navnit Singh Biring.
    </p>
    <p>Der Request und der Response werden im Wavemaker-Log abgelegt. 
    </p>
    <p>Da es sich hier um ein Testprogramm handelt, wurde kein Wert darauf gelegt den  Logger ein- oder ausschalten zu k&ouml;nnen. Das loggen dieser Werte macht nat&uuml;rlich  nur im Testbetrieb Sinn. Im Produktivbetrieb sollte man darauf verzichten. 
    </p>  
  </body>
</html>